app/controllers/courses_controller.rb

  def create
    @course = Course.new(course_params)
    if @course.save
---
INSERT INTO "courses" ("course_code", "name", "course_type", "teaching_type", "exam_type", "credit", "class_room", "course_time", "course_week", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

  def edit
    @course=Course.find_by_id(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 2]]

  def update
    @course = Course.find_by_id(params[:id])
    @course.update_attributes(:course_aim => params[:course][:course_aim],
                              :course_teacher => params[:course][:course_teacher],
                              :course_content => params[:course][:course_content])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "courses" SET "course_aim" = $1, "course_teacher" = $2, "course_content" = $3, "updated_at" = $4 WHERE "courses"."id" = $5  [["course_aim", "nihao"], ["course_teacher", nil], ["course_content", nil], ["updated_at", "2017-01-01 03:34:12.694725"], ["id", 2]]

  def open
    @course = Course.find_by_id(params[:id])
    @course.update_attributes(:open=>true)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 35]]
UPDATE "courses" SET "open" = $1, "updated_at" = $2 WHERE "courses"."id" = $3  [["open", "t"], ["updated_at", "2016-12-31 09:48:24.858875"], ["id", 35]]

  def list
     #   按照关键词（课程名称、教师名）或者下拉列表进行查询
    @course = Array.new
    @queryType = params[:queryType].to_i
    if @queryType.nil? == false
     @queryinfo = params[:query]
     if @queryinfo.nil? == false
        if @queryType == 2
            @course = Course.where("name like '%#{@queryinfo}%'")
        elsif @queryType == 10
            @teacherName = User.where("name like '%#{@queryinfo}%'")
            @teacherName.each do |teacherSingle|
                teacherSingle.teaching_courses.each do |courseSingle|
---
SELECT "courses".* FROM "courses"


    @course=@course-current_user.courses
    @course_true = Array.new
    @course.each do |single|
---
SELECT "courses".* FROM "courses" INNER JOIN "grades" ON "courses"."id" = "grades"."course_id" WHERE "grades"."user_id" = $1  [["user_id", 36]]

  def quit
    @course=Course.find_by_id(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 1]]

  def credittips
    @courses=current_user.courses
    @grades=current_user.grades
    @chosen_credit_all = 0.0
    @chosen_credit_public = 0.0
    @chosen_credit_major = 0.0
    @courses.each do |course|
      @chosen_credit_all = @chosen_credit_all+ course.credit[-3..-1].to_f
      if course.course_type == "公共选修课" then
         @chosen_credit_public = @chosen_credit_public+course.credit[-3..-1].to_f
      end
      if course.course_type == "专业核心课" then
         @chosen_credit_major = @chosen_credit_major+course.credit[-3..-1].to_f
      end
    end

   @obtained_credit_pubic = 0.0
   @obtained_credit_major = 0.0
   @obtained_credit_all = 0.0
   @grades.each do |grade|
---
SELECT "courses".* FROM "courses" INNER JOIN "grades" ON "courses"."id" = "grades"."course_id" WHERE "grades"."user_id" = $1  [["user_id", 36]]
SELECT "grades".* FROM "grades" WHERE "grades"."user_id" = $1  [["user_id", 36]]

  def courseaim
      @course=Course.find_by_id(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 1]]

  def coursecontent
      @course=Course.find_by_id(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 1]]

  def courseteacher
      @course=Course.find_by_id(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 1]]

  def courseplan
      @course=Course.find_by_id(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 1]]

  def index
    @course=current_user.teaching_courses if teacher_logged_in?
    @course=current_user.courses if student_logged_in?

    @course_all=Course.all
---
SELECT "courses".* FROM "courses"